#+TITLE: metas
#+SETUPFILE: ox.setup
* meta                                                             :org:docs:
:PROPERTIES:
:CUSTOM_ID: meta
:EXPORT_FILE_NAME: readme
:END:
This project contains documents I've written in plain-text used to
generate my [[https://rwest.io][website]] and readme files for code hosted at [[src:][hg.rwest.io]].

#+name: meta-make-tbl
#+header: :var name=(org-sbx org-current-heading-title) :var age=hg-log-age(path=(concat "/home/ellis/shed/src/" (org-sbx org-current-heading-title)))
#+header: :var rev=(org-sbx hg-rev (path (concat "/home/ellis/shed/src/" (org-sbx org-current-heading-title))))
#+header: :var num=(org-sbx hg-id-num (path (concat "/home/ellis/shed/src/" (org-sbx org-current-heading-title))))
#+header: :var lc=(org-sbx wc-dir-lines (dir (concat "/home/ellis/shed/src/" (org-sbx org-current-heading-title))))
#+header: :var cc1=(org-sbx tokei-dir-lines (dir (concat "/home/ellis/shed/src/" (org-sbx org-current-heading-title))))
#+header: :var cc2=(org-sbx tokei-dir-langs (dir (concat "/home/ellis/shed/src/" (org-sbx org-current-heading-title))))
#+header: :var ver="alpha-0.1"
#+begin_src emacs-lisp :exports results :results table :eval no-export
  (let* ((nf (format "[[https://rwest.io/m#%s][%s]]" name name))
         (rf (format "[[https://hg.rwest.io/%s/rev/%s][%s:%s]]" name rev num rev))
         (gf (format "[[https://github.com/richardwesthaver/%s][github]]" name))
         (vf (format "%s, %s" rf gf))
         (lsum (org-sbe sum-str-nums ('x 'cc1)))
         (l (split-string cc1))
         (lang (split-string cc2))
         (cf (format "%s = λ:%s #:%s _:%s" lsum (pop l) (pop l) (pop l))))
    `(("info", "")
      hline
      ("name" ,nf)
      ("version" ,ver)
      ("vc" ,vf)
      ("updated" ,age)
      ("lines" ,cf)
      ("langs" ,lang)
      hline))
#+end_src
#+RESULTS: meta-make-tbl
| info    |                          |
|---------+--------------------------|
| name    | [[https://rwest.io/m#meta][meta]]                     |
| version | alpha-0.1                |
| vc      | [[https://hg.rwest.io/meta/rev/267dd04e90d7][78+:267dd04e90d7]], [[https://github.com/richardwesthaver/meta][github]] |
| updated | 3 hours ago              |
| lines   | 7069 = λ:6561 #:29 _:479 |
| langs   | (Org)                    |
|---------+--------------------------|

#+name: ls-files-meta-heading
#+begin_src sh :results silent :exports none :var a=(expand-file-name "~/shed/src") b=(org-sbx org-current-heading-title)
  ls -lh $a/$b --time-style=long-iso \
    |awk '{if (NR!=1) print $8, $5, $6"-"$7}' \
    |awk 'BEGIN{print "file size updated"}{print $0}'
#+end_src

#+name: meta-files
#+begin_src emacs-lisp :var src=ls-files-meta-heading() :results table :colnames yes :hlines yes :exports results :eval no-export
src
#+end_src
#+RESULTS: meta-files
| file       | size |          updated |
|------------+------+------------------|
| cv.org     | 3.8K | 2021-10-27-20:37 |
| index.org  | 4.6K | 2021-11-17-23:56 |
| m.org      | 39K  | 2021-11-19-23:57 |
| n.org      | 229K | 2021-11-14-17:37 |
| ox.setup   | 580  | 2021-11-14-23:06 |
| readme.org | 11K  | 2021-11-19-23:40 |
#+CALL:shc-hg-summary() :eval yes
#+RESULTS:
: parent: 78:267dd04e90d7 tip
:  meta-files
: branch: default
: commit: 2 modified
: update: (current)
: M m.org
: M readme.org
** Commands
:PROPERTIES:
:CUSTOM_ID: shed-commands
:END:
#+begin_src shell :exports both :results output replace
  shc --help
#+end_src

#+RESULTS:
#+begin_example
shed 0.1.0-0fc01f4e2590+

ellis <ellis@rwest.io>

shed multi-development tool

USAGE:
    shed [FLAGS] [OPTIONS] [SUBCOMMAND]

FLAGS:
    -?               set the log level
    -h, --help       Print help information
    -V, --version    Print version information

OPTIONS:
    -c, --config <RON|JSON|BIN>    override configuration values

SUBCOMMANDS:
    build       build scripts
    clean       clean stuff up
    download    fetch resources
    edit        edit all the things
    help        Print this message or the help of the given subcommand(s)
    init        initialize the shed
    krypt       blackbox
    pack        create packages from file or directory
    pull        fetch resources
    push        commit changes to upstream
    serve       network services
    stash       local storage
    status      print basic info
    store       shared block storage
    unpack      unpack .z or .tz files
    x           do things with runtimes
#+end_example

